export const WILAYAS = [
  "أدرار", "الشلف", "الأغواط", "أم البواقي", "باتنة", "بجاية", "بسكرة", "بشار",
  "البليدة", "البويرة", "تمنراست", "تبسة", "تلمسان", "تيارت", "تيزي وزو", "الجزائر",
  "الجلفة", "جيجل", "سطيف", "سعيدة", "سكيكدة", "سيدي بلعباس", "عنابة", "قالمة",
  "قسنطينة", "المدية", "مستغانم", "المسيلة", "معسكر", "ورقلة", "وهران", "البيض",
  "إليزي", "برج بوعريريج", "بومرداس", "الطارف", "تندوف", "تيسمسيلت", "الوادي",
  "خنشلة", "سوق أهراس", "تيبازة", "ميلة", "عين الدفلى", "النعامة", "عين تموشنت",
  "غرداية", "غليزان", "المنيعة", "المغير", "أولاد جلال", "برج باجي مختار",
  "بني عباس", "تيميمون", "تقرت", "جانت", "عين صالح", "عين قزام",
  "تمنغست البلدية", "جبل أوليد سيدي الشيخ", "دار الحمراء", "عين الغسول",
  "الحجيرة", "تيغنيف", "الأبيض سيدي الشيخ", "بوقطب", "عين بوسيف",
  "أولاد بن عبد القادر", "حاسي بحبح"
];

export const WILAYA_SHIPPING: Record<string, number> = {};
WILAYAS.forEach(w => { WILAYA_SHIPPING[w] = 0; });
